import React, { FC } from 'react';

import { Content, TermsLabel, TermsText, Wrapper } from './styled';


export const TermsOfUse:FC = ():JSX.Element => (
  <Wrapper>
    <Content>
      <TermsLabel>
        Пользовательское соглашение:
      </TermsLabel>
      <TermsText>
        <p>
          Пользовательское соглашение подготовлено и разработано в целях регулирования взаимоотношений между Пользователем и Администратором Сайта, определения взаимных прав и обязательств Пользователя и Администратора Сайта, в том числе правового статуса (положения) последних, условий и оснований их ответственности, оснований освобождения от нее, а также порядка применения соответствующих мер воздействия за нарушения правил использования Сайта.
        </p>

        <p>
          Настоящее Пользовательское соглашение признается публичной офертой, адресованной Администратором Сайта неограниченному кругу полностью право- и дееспособных физических лиц (граждан) – Пользователям, для заключения договора на оказание услуг, предусмотренных данным Соглашением, на условиях и в порядке, установленных в Соглашении.
        </p>

        <p>
          Акцептом настоящего Соглашения признается совершение Пользователем фактических (конклюдентных) действий, свидетельствующих о принятии условий Соглашения, в частности к таким действиям относится Авторизация Пользователя на Сайте и оплата услуг Администратора
        </p>

        <p>
          Акцепт Пользовательского соглашения означает ознакомление и согласие Пользователя с его условиями, а также обязательство Пользователя исполнять все положения и правила, установленные в тексте Пользовательского соглашения.
        </p>

        <p>
          Администратор Сайта и Пользователь совместно по тексту настоящего Соглашения упоминаются как «Стороны», а по отдельности как «Сторона».
        </p>

        <ol>
          <li>
            <span>ТЕРМИНЫ, ИСПОЛЬЗУЕМЫЕ В СОГЛАШЕНИИ</span>

            <ol>
              <li>
                <span>
                  ОБЩАЯ ИНФОРМАЦИЯ:
                </span>
                <ol>
                  <li>
                    Сайт – результат интеллектуальной деятельности, представляющий собой составное произведение, расположенное в сети Интернет под определенным сетевым адресом, состоящее из веб-страниц, включающих в себя и содержащих программы для ЭВМ (программное обеспечение), обеспечивающие его техническое функционирование, графическое решение (дизайн), контент, а именно текстовую информацию, фотографические изображения, картинки, видеозаписи и др., предназначенные для оказания развлекательно-аттракционных услуг Пользователям Сайта. Под Сайтом в тексте настоящего Соглашения понимается Сайт, расположенный в сети Интернет под доменным именем (адресом) – durak-drop.com, а также его производные.
                  </li>
                  <li>
                    Администратор Сайта - лицо, обладающее правами владения, пользования и распоряжения Сайтом на законных основаниях и предоставляющее Сайт в пользование Пользователя в целях оказания последнему развлекательных услуг, предусмотренных настоящим Соглашением.
                  </li>
                  <li>
                    Пользователь – любое физическое лицо (гражданин), прошедшее процедуру Авторизации на Сайте и осуществляющее использование Сайта в соответствии с его основным назначением и функционалом, в частности для получения развлекательных услуг и морально-психологического удовлетворения от использования Сайта.
                  </li>
                  <li>
                    Авторизация на Сайте – индивидуализация и идентификация Пользователя посредством присвоения Пользователю на Сайте уникального имени, осуществляемая в порядке и способом, определенным Администратором Сайта, в частности, но не ограничиваясь указанным, посредством регистрации на Сайте (заполнения регистрационной формы на Сайте), через социальную сеть «ВКонтакте», "Google" или любым иным образом по усмотрению Администратора Сайта.
                  </li>
                  <li>
                    Виртуальный объект – 1.1.1. игровой инвентарь (валюта игры, игровой предмет и т.п.), игровой ключ и т.д., который может быть использован в многопользовательских онлайн или офлайн компьютерных играх.
                  </li>
                  <li>
                    Счет Пользователя – личная карточка Пользователя на Сайте, состоящая из учетных записей, поступивших (предоставленных) от него (ему): Денежных (электронных) средств / Виртуальной (игровой) валюты;
                    Виртуальных объектов, представленных Пользователем на Сайте, отражающая все финансово-кредитные и имущественные операции, осуществленные Пользователем на Сайте и/или через Сайт, а также остаток неизрасходованных (неиспользованных) Пользователем средств и Виртуальных объектов;
                    Игровой валюты для использования в соответствующих играх, подлежащие выводу на игровой аккаунт.
                  </li>
                  <li>
                    Электронная почта (E-mail) – специальная технология, которая обеспечивает пересылку и получение электронных сообщений, писем, файлов, документов и т.д. посредством использования сети Интернет.
                  </li>
                  <li>
                    Личный кабинет – специальное виртуальное пространство на Сайте, выделяемое (предоставляемое) Пользователю после Авторизации на Сайте, содержащее определенную информацию о нем (приобретенных/полученных Виртуальных объектах и т.д.), а также иную информацию, необходимую для использования Сайта в соответствии с его основным назначением и функционалом.
                  </li>
                </ol>
              </li>
              <li>
                В Соглашении могут быть использованы термины, не определенные в пункте 1.1. настоящего Соглашения. В этих случаях толкование терминов производится в соответствии с текстом и смыслом данного Соглашения. В случае отсутствия однозначного толкования термина в тексте настоящего Соглашения следует руководствоваться толкованием терминов: в первую очередь – определенным на Сайте, указанном в пункте 1.1.1. настоящего Соглашения, во вторую очередь – в соответствии с нормами действующего законодательства Российской Федерации.
              </li>
            </ol>
          </li>
          <li>
            <span>
              АВТОРИЗАЦИЯ ПОЛЬЗОВАТЕЛЯ И ПЕРСОНАЛЬНЫЕ ДАННЫЕ
            </span>

            <ol>
              <li>
                Использование Сайта допускается только лицами, прошедшими процедуру Авторизации на Сайте. Пользование Сайтом лицами, не обладающими полной дееспособностью в соответствии с законодательством страны резидентства Пользователя запрещено.
              </li>
              <li>
                Использование Сайта допускается исключительно в некоммерческих целях, направленных на удовлетворение личных эмоционально-психологических потребностей Пользователей.
              </li>
              <li>
                Администратор Сайта по своему усмотрению и единоличному решению определяет порядок и сведения, необходимые для Авторизации Пользователя на Сайте.
              </li>
              <li>
                При Авторизации на Сайте, его использовании, а также по соответствующему запросу Пользователь обязан указывать (в том числе в Личном кабинете) и предоставлять Администратору Сайта полную и достоверную информацию, в частности о своем имени, фамилии, отчестве, адресе электронной почты, номере контактного мобильного телефона и т.д.
              </li>
              <li>
                Если в течение 12-ти месяцев подряд Пользователь не осуществляет авторизацию на Сайте Администратор Сайта вправе расторгнуть настоящее Соглашение, уведомив об этом Пользователя по электронной почте, через Сайт или иным доступным способом. Если в течение 30 (тридцати) календарных дней с момента направления уведомления, Пользователь не совершил авторизацию на Сайте и не возобновил пользование Услугами Сайта, настоящее Соглашение с конкретным Пользователем считается расторгнутым.
              </li>
              <li>
                В случае расторжения настоящего Соглашения весь остаток Виртуальных объектов, имевшихся у Пользователя при пользовании Блоками услуг на Сайте аннулируется в момент расторжения Соглашения без какой бы то ни было компенсации.
              </li>
              <li>
                После расторжения настоящего Соглашения Пользователь не вправе заявлять какие бы то ни было претензии или требования в адрес Администратора Сайта, в том числе, но, не ограничиваясь, требовать выплаты денежных средств, предоставления Виртуальных объектов, монет и т.д.
              </li>
              <li>
                Настоящим Пользователь признает и соглашается, что размещение им информации на Сайте, а также ее передача Администратору Сайта, в том числе своих персональных данных осуществляется им самостоятельно, добровольно и по своему личному усмотрению.
              </li>
              <li>
                Настоящим Пользователь дает согласие на обработку его персональных данных. Администратор Сайта вправе использовать персональные данные Пользователя в целях исполнения настоящего Соглашения, в частности оказания услуг.
              </li>
              <li>
                Настоящим Пользователь дает согласие на получение от Администратора Сайта различных sms-рассылок, e-mail-писем и иных форм направления/получения информации, в том числе рекламных и системных сообщений и уведомлений.
              </li>
              <li>
                <span>Получение информации о Пользователях осуществляется Администратором Сайта из следующих основных источников. Информация, сообщенная и/или указанная и/или размещенная Пользователем на Сайте в рамках его использования, в частности:</span>
                <ul>
                  <li>
                    Данные о Пользователях, указанные при Авторизации на Сайте, вчастности имя, фамилия, пол, адрес электронной почты, псевдоним, пароль и иные данные о Пользователях, определенные по усмотрению Администратора Сайта;
                  </li>
                  <li>
                    Данные о Пользователях, размещенные ими в своем Личном кабинете на Сайте;
                  </li>
                  <li>
                    Данные о Пользователях, размещенные и/или указанные ими по электронной почте.
                  </li>
                  <li>
                    Данные, предоставленные Пользователями по мотивированному запросу Администратора Сайта. Настоящим устанавливается, что Администратор Сайта вправе запрашивать у Пользователей любую информацию, необходимую Администратору Сайта для выполнения своих обязательств по обеспечению доступа Пользователю к Сайту, а также для выполнения иных своих обязательств перед Пользователями. При этом на Пользователей возлагается обязанность по своевременному и достоверному предоставлению соответствующей информации в адрес Администратора Сайта.
                  </li>
                </ul>
              </li>
              <li>
                Администратор Сайта не проверяет достоверность информации, предоставляемой или полученной от Пользователей, не осуществляет контроль за их право- и дееспособностью, поскольку презюмирует, и исходит из того, что Пользователь во всех без исключения случаях предоставляет полную и достоверную информацию о себе, и поддерживает данную информацию в актуальном состоянии.
              </li>
              <li>
                Учитывая, что персональные данные с согласия Пользователя являются общедоступными, тем не менее, Администратор Сайта при обработке персональных данных Пользователей обязуется принять все организационные и технические меры для их защиты от несанкционированного доступа способом, не предусмотренным Сайтом Однако не исключено, что в результате сбоя в работе Сайта, вирусной или хакерской атаки, технических неисправностей и иных обстоятельств персональные данные Пользователя могут стать доступными и другим лицам. Пользователя могут стать доступными и другим лицам. Пользователь понимает это и соглашается с тем, что не будет предъявлять претензии к Администратору Сайта в связи с этим, учитывая, что Пользователь делает свои персональные данные общедоступными.
              </li>
              <li>
                Администратор Сайта будет стремиться избежать действий со стороны третьих лиц, направленных на получение, изменение, блокирование, уничтожение, распространение, копирование персональных данных Пользователей.
              </li>
              <li>
                <span>
                  В силу настоящего Соглашения, указывая свои персональные данные на Сайте, Пользователь безусловно соглашается:
                </span>

                <ul>
                  <li>
                    С предоставлением персональных данных неограниченному кругу лиц при помощи Сайта;
                  </li>
                  <li>
                    С обработкой персональных данных Администратором Сайта;
                  </li>
                  <li>
                    С распространением персональных данных при помощи Сайта;
                  </li>
                  <li>
                    С иными действиями Администратора Сайта в отношении таких данных в связи с функционированием Сайта.
                  </li>
                </ul>
              </li>
              <li>
                Пользователь обязуется хранить данные для использования Сайта в недоступном для третьих лиц месте, а также не сообщать и не предоставлять соответствующие сведения третьим лицам. Пользователь несет полную ответственность и риск всех возможных потенциальных и реальных негативных последствий, связанных с неисполнением настоящего правила.
              </li>
              <li>
                Размещая на Сайте свои персональные данные, Пользователь подтверждает, что делает это добровольно, а также что он добровольно предоставляет их Администратору Сайта для обработки. Настоящим Пользователь подтверждает, что предоставление им информации в порядке, установленном в настоящем Соглашении, осуществляется исключительно по самостоятельному усмотрению и волеизъявлению Пользователя.
              </li>
              <li>
                Администратор Сайта обрабатывает только те персональные данные Пользователя, которые были размещены им на Сайте. Персональные данные Пользователя обрабатываются с помощью программно-аппаратных и технических средств Сайта.
              </li>
              <li>
                Пользователь обязуется не размещать на Сайте персональные данные третьих лиц, а также не использовать персональные данные других Пользователей каким-либо образом, не соответствующим требованиям законодательства РФ, в противоправных или противозаконных целях, в целях извлечения выгоды и любых иных целях, не соответствующих целям создания Сайта.
              </li>
              <li>
                Пользователь вправе потребовать исключения (удаления) информации о нем из базы данных, формируемой на Сайте. Для этого Пользователю необходимо направить соответствующее уведомление на адрес электронной почты Администратора Сайта с указанием адреса электронной почты Пользователя, информация о котором подлежит удалению.
              </li>
              <li>
                По общему правилу Администратор Сайта не вправе осуществлять передачу информации о Пользователях третьим лицам, за исключением случаев, когда такая передача необходима для исполнения Администратором Сайта своих обязательств перед Пользователями, атакже в случаях, указанных в пункте 2.18. Соглашения.
              </li>
              <li>
                <span>
                  2.22 Случаи, в которых информация о Пользователе может быть передана третьим лицам, без предварительного согласия Пользователя:
                </span>

                <ul>
                  <li>
                    Передача информации Государственным органам, в том числе органам дознания и следствия, органам прокуратуры и органам местного самоуправления по их мотивированному запросу;
                  </li>
                  <li>
                    На основании судебного акта;
                  </li>
                  <li>
                    Третьим лицам по их мотивированному запросу в случае нарушения или предполагаемого нарушения их прав и интересов;
                  </li>
                  <li>
                    В иных случаях, определенных действующим законодательством.
                  </li>
                </ul>
              </li>
              <li>
                Администратор не несет перед Пользователем никаких обязательств по охране персональных данных Пользователя, за исключением случаев, прямо указанных в настоящем Соглашении.
              </li>
            </ol>
          </li>
          <li>
            <span>
              ПРЕДМЕТ СОГЛАШЕНИЯ
            </span>

            <ol>
              <li>
                Предметом настоящего Соглашения является установление общих условий оказания услуг Администратором Сайта Пользователям, основных прав и обязанностей последних, определение основных правил использования Сайта, указанного в пункте 1.1.1. настоящего Соглашения, а также мер ответственности за нарушение условий данного Соглашения.
              </li>
              <li>
                В рамках настоящего Пользовательского соглашения Администратор Сайта оказывает Пользователю услуги по предоставлению в пользование технических возможностей Сайта, установленных его функционалом, а Пользователь обязуется оплачивать услуги Администратора в размере, порядке и на условиях, установленных настоящим Соглашением.
              </li>
              <li>
                Предоставление услуг Администратором Сайта направлено на обеспечение возможности проведения досуга Пользователями в виде участия в безрисковых играх и развлечениях без предоставления возможности получения материального выигрыша с использованием сервисов Сайта, в частности Блоков услуг, указанных в настоящем разделе Соглашения.
              </li>
              <li>
                В рамках настоящего Пользовательского соглашения Администратор за плату, уплачиваемую Пользователем, предоставляет последнему развлекательно-аттракционные услуги посредством различных сервисов (разделов) Сайта.
              </li>
              <li>
                <span>
                  Описание соответствующих Блоков услуг, их характеристики, порядок предоставления и оказания, условия использования Сайта и порядок взаимодействия указываются в разделах 4-9 настоящего Соглашения.
                  Пользователям, использующим Блоки услуг, запрещено использовать бот-программы и попытки сговора и взаимодействия друг с другом с целью влияния на результаты оказания и предоставления данных услуг в интересах одного или нескольких из таких Пользователей. Выявление Администратором Сайта таких фактов, будет служить основанием к запрету доступа Пользователя к соответствующим Блокам услуг Сайта или в целом ко всему Сайту.
                </span>
                <ol>
                  <li>
                    Пользователь не имеет права пытаться каким-либо образом заполучить виртуальный объект вместо его передачи во время пополнения баланса.
                  </li>
                </ol>
              </li>
              <li>
                <span>
                  В рамках оказания соответствующих Блоков услуг (независимо от его названия, назначения и содержания) Администратором Сайта предоставляются Пользователю следующие сопутствующие услуги:
                </span>
                <ol>
                  <li>
                    Доступ к использованию Сайта;
                  </li>
                  <li>
                    Право на пользование техническими возможностями Сайта;
                  </li>
                  <li>
                    Предоставление информации о тех или иных многопользовательских онлайн или офлайн компьютерных играх;
                  </li>
                  <li>
                    Предоставление в распоряжение Пользователя Виртуальных объектов в порядке и на условиях, определенных соответствующим Блоком услуг.
                  </li>
                </ol>
              </li>
              <li>
                Услуги, оказываемые Администратором Сайта, являются зрелищно-развлекательными (графика/анимация, представленные на Сайте) и аттракционными (программа - симулятор). Услуги Сайта концептуально связаны с темой многопользовательских сетевых игр. Услуги, предоставляемые Администратором Сайта, направлены на удовлетворение личных эмоционально-психологических потребностей Пользователей и строятся по принципу - симулятора. Пользователь в результате пользования услугами может испытать эмоциональное удовлетворение от своего участия в симуляторе определенных игровых ситуаций, без принятия на себя бремени возможных негативных последствий того процесса (процесса, который в услугах на Сайте представлен только в виде симулятора).
              </li>
              <li>
                Услуги, предоставляемые Администратором Сайта, не являются услугами по организации и проведению основанных на риске игр, т.е. не являются азартными играми, лотереями, тотализаторами и не являются прочими услугами, при которых Пользователь несет какие-либо материальные риски. То есть услуги не являются процессами, при которых Пользователь заключает основанное на риске соглашение о выигрыше. Услуги, предоставляемые Администратором Сайта, не содержат элементов азартной игры, не содержат элементы и признаки основанного на риске соглашения о выигрыше (основанные на риске игры, рисковые игры).
              </li>
              <li>
                Администратор Сайта может отменять оказание и предоставление тех или иных Блоков услуг без предварительного уведомления Пользователей. В указанном случае Администратор Сайта восстанавливает на счете Пользователя все Виртуальные объекты, денежные средства, монеты и т.д., внесенные Пользователем для получения соответствующих услуг.
              </li>
            </ol>
          </li>
          <li>
            <span>
              РАЗДЕЛ «Главная игра»
            </span>

            <ol>
              <li>
                В рамках оказания настоящего Блока услуг, Администратор Сайта предоставляет Пользователям развлекательно-аттракционные услуги с возможностью получить тот или иной Виртуальный объект, определяемый по усмотрению Администратора Сайта и в соответствии с функционалом Сайта.
              </li>
              <li>
                Для получения соответствующей услуги Пользователь вносит плату в виде принадлежащих Пользователю средств, находящихся на Счете Пользователя.
              </li>
              <li>
                Конкретный вид Виртуального объекта, который может быть предоставлен Пользователю в рамках оказания услуги, и соответствующие ему наименование, функциональные возможности и содержание определяются в автоматическом режиме. При этом, по факту внесения платы, Пользователю предоставляется исключительно информация о категории, к которой относится соответствующая услуга (Виртуальный объект).
              </li>
              <li>
                Пользователь самостоятельно принимает решение о приобретении (получении) того или иного Виртуального объекта, категория которого определена в данном блоке Сайта.
              </li>
              <li>
                Внесенная Пользователем плата за получение услуги по приобретению Виртуального объекта является безусловно невозвратной;
              </li>
              <li>
                Конкретный вид Виртуального объекта, передаваемого Пользователю в рамках предоставления услуги, определяется в автоматическом режиме посредством случайного выбора технической системой Сайта;
              </li>
              <li>
                Конкретный вид Виртуального объекта, передаваемого Пользователю в рамках предоставления услуги, определяется в автоматическом режиме посредством случайного выбора технической системой Сайта;
              </li>
              <li>
                Предоставленный Пользователю Виртуальный объект в рамках предоставления услуги по своему содержанию и рыночной стоимости может не соответствовать плате, внесенной Пользователем.
              </li>
              <li>
                При пополнение баланса с помощью виртуального объекта пользователь обязан отыграть (использовать в блоке развлекательно-аттракционных услуг) сумму, равную сумме пополнения, для возможности посредством вывода с сайта, получения виртуального объекта в игре.
              </li>
            </ol>
          </li>
          <li>
            <span>
              РАСЧЕТЫ МЕЖДУ СТОРОНАМИ
            </span>
            <ol>
              <li>
                За предоставление услуг, предусмотренных настоящим Соглашением, Пользователь обязуется оплатить Администратору Сайта вознаграждение в размерах и порядках, определенных соответствующими блоками услуг.
              </li>
              <li>
                Оплата услуг Администратора осуществляется посредством списания соответствующей суммы или удержания соответствующего Виртуального объекта или списания соответствующего количества монет со Счета Пользователя в счет оплаты услуг за пользование Сайтом, предоставляемых Администратором Сайта.
              </li>
              <li>
                Способы пополнения Счета Пользователя, используемые платежные системы, определяются по усмотрению Администратора Сайта и внедряются в технический функционал Сайта.
              </li>
              <li>
                Комиссии, связанные с оплатой услуг Администратора Сайта (с пополнением Счета Пользователя), оплачиваются Пользователем самостоятельно.
              </li>
              <li>
                В случае, когда у Пользователя недостаточно средств, необходимых для оплаты услуг Администратора Сайта в размере, определенным соответствующим Блоком услуг, Администратор Сайта не предоставляет такому Пользователю возможность в получении Виртуального объекта.
              </li>
              <li>
                В случае, если Пользователь не совершал никаких операций на сайте (Пополнение счета или принятие участия в игре) в течение 60 (шестидесяти) суток, Администратор Сайта вправе списать у такого Пользователя оставшееся на балансе золото и рубли.
              </li>
              <li>
                В случае использования пользователем уязвимостей в программном коде Сайта для получения выгоды, Администратор сайта оставляет за собой право заблокировать такого Пользователя и списать все полученные таким способом средства с баланса на Сайте.
              </li>
            </ol>
          </li>
          <li>
            <span>
              ОТВЕТСТВЕННОСТЬ
            </span>
            <ol>
              <li>
                За нарушение условий, установленных настоящим Соглашением, Пользователь и Администратор Сайта несут ответственность в соответствии с действующим законодательством.
              </li>
              <li>
                <span>
                  За нарушение настоящего Соглашения Администратор Сайта вправе применить к Пользователю следующие меры:
                </span>
                <ul>
                  <li>
                    Заблокировать доступ Пользователя к его Личному кабинету на определенный срок или без ограничения срока, и блокировать все аккаунты, зарегестрированные в последующем времени;
                  </li>
                  <li>
                    Аннулировать (деактивировать) Личный кабинет Пользователя;
                  </li>
                  <li>
                    Ограничить сферу возможного использования Пользователем Сайта на определенный срок или без определения срока.
                  </li>
                </ul>
              </li>
              <li>
                <span>
                  Администратор Сайта не несет ответственность за убытки и расходы, возникшие у Пользователя в связи с использованием Сайта, в частности:
                </span>
                <ul>
                  <li>
                    Убытки и расходы, вызванные использованием информации, размещенной на Сайте.
                  </li>
                  <li>
                    Убытки и расходы, вызванные несанкционированным доступом третьих лиц, в том числе других Пользователей, к Личному кабинету Пользователя.
                  </li>
                  <li>
                    Убытки и расходы, возникшие у Пользователя в связи с неполучением Виртуального объекта, получением Виртуального объекта, не соответствующего желаниям и/или намерениям Пользователя.
                  </li>
                  <li>
                    Убытки и расходы, вызванные не зависимыми от Администрации проблемами, катаклизмами и форс-мажорными факторами и/или обстоятельствами.

                  </li>
                </ul>
              </li>
            </ol>
          </li>
        </ol>
      </TermsText>
    </Content>
  </Wrapper>
);
