import React, { FC } from 'react';


import { Accordion } from '../../../shared/ui-kit';


export const Faq:FC = ():JSX.Element => (
  <>
    <Accordion
      label="test"
    >
      <p>
        Нажмите на пополнить. Выберете метод пополнения:
        <ol>
          <li>
            При пополнении деньгами впишите количество кредитов/рублей и оплатите покупку.
          </li>
          <li>
            При пополнении кредитами выберете сумму и следуйте появившемся инструкциям, а именно:
          </li>
        </ol>
      </p>
      <p>
        <ol>
          <li>
            Добавьте наш аккаунт в друзья, никнейм - (отобразится после начала). Заявка принимается в
            течение 5-10 секунд.
          </li>
        </ol>

      </p>
      <p>
        <ol start={2}>
          <li>
            Отправьте нам в личные сообщения в игре ваш айди с сайта (он отобразится в окне
            пополнения), примите приглашение от нашего аккаунта и сразу проиграйте игру. Если вы не
            успели зайти/нажать готов - повторите этот пункт с начала, пока ваша заявка открыта.
          </li>
        </ol>

      </p>
      <p>
        Не успел принять приглашение/нажать готов? Завис интернет?
        Повторите пункт №2, пока ваша заявка на пополнение активна.
      </p>
    </Accordion>

    <Accordion
      label="test"
    >
      <p>
        Нажмите на пополнить. Выберете метод пополнения:
        <ol>
          <li>
            При пополнении деньгами впишите количество кредитов/рублей и оплатите покупку.
          </li>
          <li>
            При пополнении кредитами выберете сумму и следуйте появившемся инструкциям, а именно:
          </li>
        </ol>
      </p>
      <p>
        <ol>
          <li>
            Добавьте наш аккаунт в друзья, никнейм - (отобразится после начала). Заявка принимается в
            течение 5-10 секунд.
          </li>
        </ol>

      </p>
      <p>
        <ol start={2}>
          <li>
            Отправьте нам в личные сообщения в игре ваш айди с сайта (он отобразится в окне
            пополнения), примите приглашение от нашего аккаунта и сразу проиграйте игру. Если вы не
            успели зайти/нажать готов - повторите этот пункт с начала, пока ваша заявка открыта.
          </li>
        </ol>

      </p>
      <p>
        Не успел принять приглашение/нажать готов? Завис интернет?
        Повторите пункт №2, пока ваша заявка на пополнение активна.
      </p>
    </Accordion>

    <Accordion
      label="test"
    >
      <p>
        Нажмите на пополнить. Выберете метод пополнения:
        <ol>
          <li>
            При пополнении деньгами впишите количество кредитов/рублей и оплатите покупку.
          </li>
          <li>
            При пополнении кредитами выберете сумму и следуйте появившемся инструкциям, а именно:
          </li>
        </ol>
      </p>
      <p>
        <ol>
          <li>
            Добавьте наш аккаунт в друзья, никнейм - (отобразится после начала). Заявка принимается в
            течение 5-10 секунд.
          </li>
        </ol>

      </p>
      <p>
        <ol start={2}>
          <li>
            Отправьте нам в личные сообщения в игре ваш айди с сайта (он отобразится в окне
            пополнения), примите приглашение от нашего аккаунта и сразу проиграйте игру. Если вы не
            успели зайти/нажать готов - повторите этот пункт с начала, пока ваша заявка открыта.
          </li>
        </ol>

      </p>
      <p>
        Не успел принять приглашение/нажать готов? Завис интернет?
        Повторите пункт №2, пока ваша заявка на пополнение активна.
      </p>
    </Accordion>

    <Accordion
      label="test"
    >
      <p>
        Нажмите на пополнить. Выберете метод пополнения:
        <ol>
          <li>
            При пополнении деньгами впишите количество кредитов/рублей и оплатите покупку.
          </li>
          <li>
            При пополнении кредитами выберете сумму и следуйте появившемся инструкциям, а именно:
          </li>
        </ol>
      </p>
      <p>
        <ol>
          <li>
            Добавьте наш аккаунт в друзья, никнейм - (отобразится после начала). Заявка принимается в
            течение 5-10 секунд.
          </li>
        </ol>

      </p>
      <p>
        <ol start={2}>
          <li>
            Отправьте нам в личные сообщения в игре ваш айди с сайта (он отобразится в окне
            пополнения), примите приглашение от нашего аккаунта и сразу проиграйте игру. Если вы не
            успели зайти/нажать готов - повторите этот пункт с начала, пока ваша заявка открыта.
          </li>
        </ol>

      </p>
      <p>
        Не успел принять приглашение/нажать готов? Завис интернет?
        Повторите пункт №2, пока ваша заявка на пополнение активна.
      </p>
    </Accordion>

    <Accordion
      label="test"
    >
      <p>
        Нажмите на пополнить. Выберете метод пополнения:
        <ol>
          <li>
            При пополнении деньгами впишите количество кредитов/рублей и оплатите покупку.
          </li>
          <li>
            При пополнении кредитами выберете сумму и следуйте появившемся инструкциям, а именно:
          </li>
        </ol>
      </p>
      <p>
        <ol>
          <li>
            Добавьте наш аккаунт в друзья, никнейм - (отобразится после начала). Заявка принимается в
            течение 5-10 секунд.
          </li>
        </ol>

      </p>
      <p>
        <ol start={2}>
          <li>
            Отправьте нам в личные сообщения в игре ваш айди с сайта (он отобразится в окне
            пополнения), примите приглашение от нашего аккаунта и сразу проиграйте игру. Если вы не
            успели зайти/нажать готов - повторите этот пункт с начала, пока ваша заявка открыта.
          </li>
        </ol>

      </p>
      <p>
        Не успел принять приглашение/нажать готов? Завис интернет?
        Повторите пункт №2, пока ваша заявка на пополнение активна.
      </p>
    </Accordion>

    <Accordion
      label="test"
    >
      <p>
        Нажмите на пополнить. Выберете метод пополнения:
        <ol>
          <li>
            При пополнении деньгами впишите количество кредитов/рублей и оплатите покупку.
          </li>
          <li>
            При пополнении кредитами выберете сумму и следуйте появившемся инструкциям, а именно:
          </li>
        </ol>
      </p>
      <p>
        <ol>
          <li>
            Добавьте наш аккаунт в друзья, никнейм - (отобразится после начала). Заявка принимается в
            течение 5-10 секунд.
          </li>
        </ol>

      </p>
      <p>
        <ol start={2}>
          <li>
            Отправьте нам в личные сообщения в игре ваш айди с сайта (он отобразится в окне
            пополнения), примите приглашение от нашего аккаунта и сразу проиграйте игру. Если вы не
            успели зайти/нажать готов - повторите этот пункт с начала, пока ваша заявка открыта.
          </li>
        </ol>

      </p>
      <p>
        Не успел принять приглашение/нажать готов? Завис интернет?
        Повторите пункт №2, пока ваша заявка на пополнение активна.
      </p>
    </Accordion>
  </>
);
